Catalogs/ICMP_Пакет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ICMP_Пакет</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержимое</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ICMP_ВерсииПакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ICMP_ВерсииПакета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ICMP_Пакет</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержимое</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредназначенныеКонфигурации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конфигурация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ICMP_Конфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ICMP_Пакет/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДобавитьФайл_Завершение(Результат, Адрес, 
	ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ДобавитьФайл_Завершение_Сервер(Адрес, ВыбранноеИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФайл_Завершение_Сервер(Адрес, ВыбранноеИмяФайла)
	
	яДвДанные = ПолучитьИзВременногоХранилища(Адрес);
	яФ = Новый Файл(ВыбранноеИмяФайла);
	яИмяФайла = ПолучитьИмяВременногоФайла(яФ.Расширение);
	Попытка
		яДвДанные.Записать(яИмяФайла);
		яОбработка = ВнешниеОбработки.Создать(яИмяФайла);     
		яИД = яОбработка.Метаданные().Имя;
		Если яИД <> Объект.Идентификатор И ЗначениеЗаполнено(Объект.Идентификатор) Тогда
			Сообщить("Идентификатор обработки не совпадает с именем из файла. Операция прервана.");
			Возврат;
		КонецЕсли;
		яСведения = яОбработка.СведенияОВнешнейОбработке();
		УдалитьФайлы(яИмяФайла);
		
		яВерсия = яСведения.Версия;
		Объект.Описание = яСведения.Информация;
		Объект.Наименование = яСведения.Наименование;
		Объект.Идентификатор = яИД;
		
		Модифицированность = Истина;
		Если Объект.Ссылка.Пустая() Тогда
			Сообщить("Необходимо записать объект и повторить добавление обработки из пакета.");
			Возврат;
		КонецЕсли;
		
		яЗ = Новый Запрос(
		"ВЫБРАТЬ
		|	ICMP_ВерсииПакета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ICMP_ВерсииПакета КАК ICMP_ВерсииПакета
		|ГДЕ
		|	ICMP_ВерсииПакета.Владелец = &Владелец
		|	И ICMP_ВерсииПакета.Версия = &Версия");
		яЗ.УстановитьПараметр("Владелец", Объект.Ссылка);
		яЗ.УстановитьПараметр("Версия", яВерсия);
		яВ = яЗ.Выполнить().Выбрать();
		Если яВ.Следующий() Тогда
			яОб = яВ.Ссылка.ПолучитьОбъект();
		Иначе
			яОб = Справочники.ICMP_ВерсииПакета.СоздатьЭлемент();
		КонецЕсли;
		яОб.Версия = яВерсия;
		яОб.Владелец = Объект.Ссылка;
		яОб.Содержимое = Новый ХранилищеЗначения(яДвДанные, Новый СжатиеДанных(1));
		яОб.ИмяФайлаОбработки = яФ.Имя;
		Если ПустаяСтрока(яОб.Наименование) Тогда
			яОб.Наименование = "Версия " + яВерсия;
		КонецЕсли;
		яОб.Записать();
		
	Исключение
		яОшибка = ОписаниеОшибки();
		Сообщить(яОшибка);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	яОповещение = Новый ОписаниеОповещения("ДобавитьФайл_Завершение", ЭтаФорма);
	НачатьПомещениеФайла(яОповещение,,,Истина);
КонецПроцедуры
